HUSTerRail/Thyristor_controller/bsp/stm32/stm32f407-baozhuang/board/CubeMX_Config/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32f4xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */
//#include <rtthread.h>
/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */

/* USER CODE END EM */

void HAL_TIM_MspPostInit(TIM_HandleTypeDef *htim);

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define GPIO_MO12_Pin GPIO_PIN_2
#define GPIO_MO12_GPIO_Port GPIOE
#define GPIO_MO13_Pin GPIO_PIN_3
#define GPIO_MO13_GPIO_Port GPIOE
#define GPIO_MO14_Pin GPIO_PIN_4
#define GPIO_MO14_GPIO_Port GPIOE
#define GPIO_MO15_Pin GPIO_PIN_6
#define GPIO_MO15_GPIO_Port GPIOE
#define GPIO_Z_ALARM_Pin GPIO_PIN_13
#define GPIO_Z_ALARM_GPIO_Port GPIOC
#define GPIO_MI1_Pin GPIO_PIN_0
#define GPIO_MI1_GPIO_Port GPIOF
#define GPIO_MI2_Pin GPIO_PIN_1
#define GPIO_MI2_GPIO_Port GPIOF
#define GPIO_MI3_Pin GPIO_PIN_2
#define GPIO_MI3_GPIO_Port GPIOF
#define GPIO_MI4_Pin GPIO_PIN_3
#define GPIO_MI4_GPIO_Port GPIOF
#define GPIO_MI5_Pin GPIO_PIN_4
#define GPIO_MI5_GPIO_Port GPIOF
#define GPIO_MI6_Pin GPIO_PIN_5
#define GPIO_MI6_GPIO_Port GPIOF
#define GPIO_MI7_Pin GPIO_PIN_6
#define GPIO_MI7_GPIO_Port GPIOF
#define GPIO_MI8_Pin GPIO_PIN_7
#define GPIO_MI8_GPIO_Port GPIOF
#define GPIO_MI9_Pin GPIO_PIN_8
#define GPIO_MI9_GPIO_Port GPIOF
#define GPIO_MI11_Pin GPIO_PIN_10
#define GPIO_MI11_GPIO_Port GPIOF
#define X_LABEL_Pin GPIO_PIN_3
#define X_LABEL_GPIO_Port GPIOA
#define BOOT1_Pin GPIO_PIN_2
#define BOOT1_GPIO_Port GPIOB
#define GPIO_MI12_Pin GPIO_PIN_11
#define GPIO_MI12_GPIO_Port GPIOF
#define GPIO_MI13_Pin GPIO_PIN_12
#define GPIO_MI13_GPIO_Port GPIOF
#define GPIO_MI14_Pin GPIO_PIN_13
#define GPIO_MI14_GPIO_Port GPIOF
#define GPIO_MI15_Pin GPIO_PIN_14
#define GPIO_MI15_GPIO_Port GPIOF
#define GPIO_MI16_Pin GPIO_PIN_15
#define GPIO_MI16_GPIO_Port GPIOF
#define GPIO_MO1_Pin GPIO_PIN_0
#define GPIO_MO1_GPIO_Port GPIOG
#define GPIO_MO2_Pin GPIO_PIN_1
#define GPIO_MO2_GPIO_Port GPIOG
#define GPIO_MO16_Pin GPIO_PIN_7
#define GPIO_MO16_GPIO_Port GPIOE
#define ALM_Pin GPIO_PIN_8
#define ALM_GPIO_Port GPIOE
#define GPIO_Z_EN_Pin GPIO_PIN_10
#define GPIO_Z_EN_GPIO_Port GPIOE
#define GPIO_Y_ALARM_Pin GPIO_PIN_12
#define GPIO_Y_ALARM_GPIO_Port GPIOE
#define ZLABEL_Pin GPIO_PIN_14
#define ZLABEL_GPIO_Port GPIOE
#define GPIO_X_ALARM_Pin GPIO_PIN_15
#define GPIO_X_ALARM_GPIO_Port GPIOE
#define GPIO_X_EN_Pin GPIO_PIN_10
#define GPIO_X_EN_GPIO_Port GPIOD
#define GPIO_Y_EN_Pin GPIO_PIN_11
#define GPIO_Y_EN_GPIO_Port GPIOD
#define XLABEL_Pin GPIO_PIN_15
#define XLABEL_GPIO_Port GPIOD
#define GPIO_MO3_Pin GPIO_PIN_2
#define GPIO_MO3_GPIO_Port GPIOG
#define GPIO_MO4_Pin GPIO_PIN_3
#define GPIO_MO4_GPIO_Port GPIOG
#define GPIO_MO5_Pin GPIO_PIN_4
#define GPIO_MO5_GPIO_Port GPIOG
#define GPIO_MO6_Pin GPIO_PIN_5
#define GPIO_MO6_GPIO_Port GPIOG
#define GPIO_MO7_Pin GPIO_PIN_6
#define GPIO_MO7_GPIO_Port GPIOG
#define GPIO_MO8_Pin GPIO_PIN_7
#define GPIO_MO8_GPIO_Port GPIOG
#define GPIO_MO9_Pin GPIO_PIN_8
#define GPIO_MO9_GPIO_Port GPIOG
#define OLABEL_Pin GPIO_PIN_9
#define OLABEL_GPIO_Port GPIOC
#define GPIO_ETF_RESET_Pin GPIO_PIN_8
#define GPIO_ETF_RESET_GPIO_Port GPIOA
#define SPI3_CS_Pin GPIO_PIN_11
#define SPI3_CS_GPIO_Port GPIOC
#define GPIO_Z_DIR_Pin GPIO_PIN_2
#define GPIO_Z_DIR_GPIO_Port GPIOD
#define GPIO_Y_DIR_Pin GPIO_PIN_3
#define GPIO_Y_DIR_GPIO_Port GPIOD
#define D485_A_Pin GPIO_PIN_4
#define D485_A_GPIO_Port GPIOD
#define D485_B_Pin GPIO_PIN_7
#define D485_B_GPIO_Port GPIOD
#define LED_RUN_Pin GPIO_PIN_10
#define LED_RUN_GPIO_Port GPIOG
#define LED_ALARM_Pin GPIO_PIN_11
#define LED_ALARM_GPIO_Port GPIOG
#define FLASH_CS_Pin GPIO_PIN_12
#define FLASH_CS_GPIO_Port GPIOG
#define GPIO_MI10_Pin GPIO_PIN_15
#define GPIO_MI10_GPIO_Port GPIOG
#define GPIO_KEY_Pin GPIO_PIN_4
#define GPIO_KEY_GPIO_Port GPIOB
#define GPIO_X_DIR_Pin GPIO_PIN_7
#define GPIO_X_DIR_GPIO_Port GPIOB
#define GPIO_XI_CS_Pin GPIO_PIN_8
#define GPIO_XI_CS_GPIO_Port GPIOB
#define GPIO_MO10_Pin GPIO_PIN_0
#define GPIO_MO10_GPIO_Port GPIOE
#define GPIO_MO11_Pin GPIO_PIN_1
#define GPIO_MO11_GPIO_Port GPIOE
/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
